<template>
  <div class="about">
    <v-heading variant="h1">
      О нас
    </v-heading>

    <v-paragraph>
      На самом деле не "о нас", а "о приложении". Это тестовое приложение c использванием стека MEVN<sup>*</sup>.
    </v-paragraph>

    <v-paragraph
      variant="note"
      size="small"
    >
      <sup>*</sup> Mongo Express Vue Node
    </v-paragraph>

    <v-paragraph>
      При его создании старался следовать
      <v-link
        href="https://ru.vuejs.org/v2/style-guide/"
        target="_blank"
      >официальному</v-link>
      стайлгайду. Например, используются локальные стили компонентов (глобальные подключаются непосредственно в App.vue,
      а для автоматической загрузки глобальных переменных и миксинов в каждый компонент используется <code>style-resources-loader</code>).
    </v-paragraph>

    <v-heading variant="h2">
      Авторизация и роли пользователей
    </v-heading>

    <v-paragraph>
      В приложении реализована авторизация по номеру телефона (иммитация с генерацией кода для отправки по SMS и его проверка). При первой удачной авторизации
      новый юзер добавляется в базу, при последующих авторизациях по тому же номеру ему доступна история заказов, к нему уже привязан
      адрес (если он был ранее введен). На странице пользователя можно отредактировать ФИО, адрес, перепривязать номер телефона.
    </v-paragraph>

    <v-paragraph>
      У пользователей есть роли (всего две). Роутинг учитывает эти роли: неавторизованным и обычным доступна корзина, авторизованным - история покупок
      и обращения, админам доступна страница добавления товара (у возможность удаления из листинга). Права админа устанавливаются вручную в базе.
    </v-paragraph>

    <v-heading variant="h2">
      Каталог товаров и корзина
    </v-heading>

    <v-paragraph>
      В листинге товаров реализован фильтр по категориям и продуктам в составе блюд. Сам листинг сверстан с использованием ccs grid. В карточках товара есть возможность выбрать количество
      перед добавлением в корзину. Если товар уже есть в корзине - вместо выбора количества и кнопки "в корзину" ссылка с описанием на страницу корзины.
    </v-paragraph>

    <v-paragraph>
      Для неавторизованных пользователей корзина формируется в localstorage, для авторизованных записывается в базу. Если пользователь логинится
      с непустой корзиной в localstorage - содержимое корзин сливается и записывается в базу до оформления заказа. В корзине можно изменить
      количество товаров, удалить конкретный товар или очистить корзину.
    </v-paragraph>

    <v-heading variant="h3">
      Еще чуть-чуть конкретики
    </v-heading>

    <v-paragraph>
      Используется хранилище vuex. Юнит-тесты - jest.
    </v-paragraph>

    <v-heading variant="h2">
      Планы
    </v-heading>

    <v-paragraph
      size="large"
    >
      Внедрить typescript и graphql<br />
      Покрыть все умные компоненты тестами (TDD пока непривычен)<br />
      Выводить список заказов админу<br />
      Выводить админу список отзывов/запросов
    </v-paragraph>
  </div>
</template>

<script>
import VHeading from "@/components/VHeading";
import VParagraph from "@/components/VParagraph";
import VLink from "@/components/VLink";

export default {
  components: {
    VLink,
    VParagraph,
    VHeading,
  }
}
</script>
